MikroElektronika/core_packages/PIC/XC8/def/PIC18LF25K50/mcu.h
// Register: TOSL
#define TOSL TOSL
extern volatile unsigned char           TOSL                __at(0xFFD);
#ifndef _LIB_BUILD
asm("TOSL equ 0FFDh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned TOSL                   :8;
    };
} TOSLbits_t;
extern volatile TOSLbits_t TOSLbits __at(0xFFD);
// bitfield macros
#define _TOSL_TOSL_POSN                                     0x0
#define _TOSL_TOSL_POSITION                                 0x0
#define _TOSL_TOSL_SIZE                                     0x8
#define _TOSL_TOSL_LENGTH                                   0x8
#define _TOSL_TOSL_MASK                                     0xFF

// Register: TOSH
#define TOSH TOSH
extern volatile unsigned char           TOSH                __at(0xFFE);
#ifndef _LIB_BUILD
asm("TOSH equ 0FFEh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned TOSH                   :8;
    };
} TOSHbits_t;
extern volatile TOSHbits_t TOSHbits __at(0xFFE);
// bitfield macros
#define _TOSH_TOSH_POSN                                     0x0
#define _TOSH_TOSH_POSITION                                 0x0
#define _TOSH_TOSH_SIZE                                     0x8
#define _TOSH_TOSH_LENGTH                                   0x8
#define _TOSH_TOSH_MASK                                     0xFF

// Register: TOSU
#define TOSU TOSU
extern volatile unsigned char           TOSU                __at(0xFFF);
#ifndef _LIB_BUILD
asm("TOSU equ 0FFFh");
#endif

/*
 * Bit Definitions
 */
#define _DEPRECATED __attribute__((__deprecated__))
#ifndef BANKMASK
#define BANKMASK(addr) ((addr)&0FFh)
#endif
#define _BIT_ACCESS(r,b) ___mkstr(BANKMASK(r)) "," ___mkstr(b)
#ifndef PAGEMASK
#define PAGEMASK(addr) ((addr)&0FFFFFh)
#endif
// BAUDCON1<ABDEN>
extern volatile __bit                   ABDEN               __at(0x7DC0);	// @ (0xFB8 * 8 + 0)
#define                                 ABDEN_bit           _BIT_ACCESS(BAUDCON1,0)
// BAUDCON1<ABDEN1>
extern volatile __bit                   ABDEN1              __at(0x7DC0);	// @ (0xFB8 * 8 + 0)
#define                                 ABDEN1_bit          _BIT_ACCESS(BAUDCON1,0)
// BAUDCON1<ABDOVF>
extern volatile __bit                   ABDOVF              __at(0x7DC7);	// @ (0xFB8 * 8 + 7)
#define                                 ABDOVF_bit          _BIT_ACCESS(BAUDCON1,7)
// BAUDCON1<ABDOVF1>
extern volatile __bit                   ABDOVF1             __at(0x7DC7);	// @ (0xFB8 * 8 + 7)
#define                                 ABDOVF1_bit         _BIT_ACCESS(BAUDCON1,7)
// SSP1CON2<ACKDT>
extern volatile __bit                   ACKDT               __at(0x7E2D);	// @ (0xFC5 * 8 + 5)
#define                                 ACKDT_bit           _BIT_ACCESS(SSP1CON2,5)
// SSP1CON2<ACKDT1>
extern volatile __bit                   ACKDT1              __at(0x7E2D);	// @ (0xFC5 * 8 + 5)
#define                                 ACKDT1_bit          _BIT_ACCESS(SSP1CON2,5)
// SSP1CON2<ACKEN>
extern volatile __bit                   ACKEN               __at(0x7E2C);	// @ (0xFC5 * 8 + 4)
#define                                 ACKEN_bit           _BIT_ACCESS(SSP1CON2,4)
// SSP1CON2<ACKEN1>
extern volatile __bit                   ACKEN1              __at(0x7E2C);	// @ (0xFC5 * 8 + 4)
#define                                 ACKEN1_bit          _BIT_ACCESS(SSP1CON2,4)
// SSP1CON2<ACKSTAT>
extern volatile __bit                   ACKSTAT             __at(0x7E2E);	// @ (0xFC5 * 8 + 6)
#define                                 ACKSTAT_bit         _BIT_ACCESS(SSP1CON2,6)
// SSP1CON2<ACKSTAT1>
extern volatile __bit                   ACKSTAT1            __at(0x7E2E);	// @ (0xFC5 * 8 + 6)
#define                                 ACKSTAT1_bit        _BIT_ACCESS(SSP1CON2,6)
// SSP1CON3<ACKTIM>
extern volatile __bit                   ACKTIM              __at(0x7E5F);	// @ (0xFCB * 8 + 7)
#define                                 ACKTIM_bit          _BIT_ACCESS(SSP1CON3,7)
// ADCON2<ACQT0>
extern volatile __bit                   ACQT0               __at(0x7E03);	// @ (0xFC0 * 8 + 3)
#define                                 ACQT0_bit           _BIT_ACCESS(ADCON2,3)
// ADCON2<ACQT1>
extern volatile __bit                   ACQT1               __at(0x7E04);	// @ (0xFC0 * 8 + 4)
#define                                 ACQT1_bit           _BIT_ACCESS(ADCON2,4)
// ADCON2<ACQT2>
extern volatile __bit                   ACQT2               __at(0x7E05);	// @ (0xFC0 * 8 + 5)
#define                                 ACQT2_bit           _BIT_ACCESS(ADCON2,5)
// ACTCON<ACTD>
extern volatile __bit                   ACTD                __at(0x7DAE);	// @ (0xFB5 * 8 + 6)
#define                                 ACTD_bit            _BIT_ACCESS(ACTCON,6)
// ACTCON<ACTEN>
extern volatile __bit                   ACTEN               __at(0x7DAF);	// @ (0xFB5 * 8 + 7)
#define                                 ACTEN_bit           _BIT_ACCESS(ACTCON,7)
// PIE1<ACTIE>
extern volatile __bit                   ACTIE               __at(0x7CEF);	// @ (0xF9D * 8 + 7)
#define                                 ACTIE_bit           _BIT_ACCESS(PIE1,7)
// PIR1<ACTIF>
extern volatile __bit                   ACTIF               __at(0x7CF7);	// @ (0xF9E * 8 + 7)
#define                                 ACTIF_bit           _BIT_ACCESS(PIR1,7)
// IPR1<ACTIP>
extern volatile __bit                   ACTIP               __at(0x7CFF);	// @ (0xF9F * 8 + 7)
#define                                 ACTIP_bit           _BIT_ACCESS(IPR1,7)
// ACTCON<ACTLOCK>
extern volatile __bit                   ACTLOCK             __at(0x7DAB);	// @ (0xFB5 * 8 + 3)
#define                                 ACTLOCK_bit         _BIT_ACCESS(ACTCON,3)
// PMD0<ACTMD>
extern volatile __bit                   ACTMD               __at(0x7BF4);	// @ (0xF7E * 8 + 4)
#define                                 ACTMD_bit           _BIT_ACCESS(PMD0,4)
// ACTCON<ACTOR>
extern volatile __bit                   ACTOR               __at(0x7DA9);	// @ (0xFB5 * 8 + 1)
#define                                 ACTOR_bit           _BIT_ACCESS(ACTCON,1)
// ACTCON<ACTORS>
extern volatile __bit                   ACTORS              __at(0x7DA9);	// @ (0xFB5 * 8 + 1)
#define                                 ACTORS_bit          _BIT_ACCESS(ACTCON,1)
// ACTCON<ACTSEL>
extern volatile __bit                   ACTSEL              __at(0x7DAF);	// @ (0xFB5 * 8 + 7)
#define                                 ACTSEL_bit          _BIT_ACCESS(ACTCON,7)
// ACTCON<ACTSRC>
extern volatile __bit                   ACTSRC              __at(0x7DAC);	// @ (0xFB5 * 8 + 4)
#define                                 ACTSRC_bit          _BIT_ACCESS(ACTCON,4)
// ACTCON<ACTUD>
extern volatile __bit                   ACTUD               __at(0x7DAE);	// @ (0xFB5 * 8 + 6)
#define                                 ACTUD_bit           _BIT_ACCESS(ACTCON,6)
// UIE<ACTVIE>
extern volatile __bit                   ACTVIE              __at(0x7B22);	// @ (0xF64 * 8 + 2)
#define                                 ACTVIE_bit          _BIT_ACCESS(UIE,2)
// UIR<ACTVIF>
extern volatile __bit                   ACTVIF              __at(0x7B2A);	// @ (0xF65 * 8 + 2)
#define                                 ACTVIF_bit          _BIT_ACCESS(UIR,2)
// PMD1<ADCMD>
extern volatile __bit                   ADCMD               __at(0x7BFA);	// @ (0xF7F * 8 + 2)
#define                                 ADCMD_bit           _BIT_ACCESS(PMD1,2)
// ADCON2<ADCS0>
extern volatile __bit                   ADCS0               __at(0x7E00);	// @ (0xFC0 * 8 + 0)
#define                                 ADCS0_bit           _BIT_ACCESS(ADCON2,0)
// ADCON2<ADCS1>
extern volatile __bit                   ADCS1               __at(0x7E01);	// @ (0xFC0 * 8 + 1)
#define                                 ADCS1_bit           _BIT_ACCESS(ADCON2,1)
// ADCON2<ADCS2>
extern volatile __bit                   ADCS2               __at(0x7E02);	// @ (0xFC0 * 8 + 2)
#define                                 ADCS2_bit           _BIT_ACCESS(ADCON2,2)
// RCSTA1<ADDEN>
extern volatile __bit                   ADDEN               __at(0x7D5B);	// @ (0xFAB * 8 + 3)
#define                                 ADDEN_bit           _BIT_ACCESS(RCSTA1,3)
// UADDR<ADDR0>
extern volatile __bit                   ADDR0               __at(0x7B18);	// @ (0xF63 * 8 + 0)
#define                                 ADDR0_bit           _BIT_ACCESS(UADDR,0)
// UADDR<ADDR1>
extern volatile __bit                   ADDR1               __at(0x7B19);	// @ (0xF63 * 8 + 1)
#define                                 ADDR1_bit           _BIT_ACCESS(UADDR,1)
// UADDR<ADDR2>
extern volatile __bit                   ADDR2               __at(0x7B1A);	// @ (0xF63 * 8 + 2)
#define                                 ADDR2_bit           _BIT_ACCESS(UADDR,2)
// UADDR<ADDR3>
extern volatile __bit                   ADDR3               __at(0x7B1B);	// @ (0xF63 * 8 + 3)
#define                                 ADDR3_bit           _BIT_ACCESS(UADDR,3)
// UADDR<ADDR4>
extern volatile __bit                   ADDR4               __at(0x7B1C);	// @ (0xF63 * 8 + 4)
#define                                 ADDR4_bit           _BIT_ACCESS(UADDR,4)
// UADDR<ADDR5>
extern volatile __bit                   ADDR5               __at(0x7B1D);	// @ (0xF63 * 8 + 5)
#define                                 ADDR5_bit           _BIT_ACCESS(UADDR,5)
// UADDR<ADDR6>
extern volatile __bit                   ADDR6               __at(0x7B1E);	// @ (0xF63 * 8 + 6)
#define                                 ADDR6_bit           _BIT_ACCESS(UADDR,6)
// RCSTA1<ADEN>
extern volatile __bit                   ADEN                __at(0x7D5B);	// @ (0xFAB * 8 + 3)
#define                                 ADEN_bit            _BIT_ACCESS(RCSTA1,3)
// ADCON2<ADFM>
extern volatile __bit                   ADFM                __at(0x7E07);	// @ (0xFC0 * 8 + 7)
#define                                 ADFM_bit            _BIT_ACCESS(ADCON2,7)
// PIE1<ADIE>
extern volatile __bit                   ADIE                __at(0x7CEE);	// @ (0xF9D * 8 + 6)
#define                                 ADIE_bit            _BIT_ACCESS(PIE1,6)
// PIR1<ADIF>
extern volatile __bit                   ADIF                __at(0x7CF6);	// @ (0xF9E * 8 + 6)
#define                                 ADIF_bit            _BIT_ACCESS(PIR1,6)
// IPR1<ADIP>
extern volatile __bit                   ADIP                __at(0x7CFE);	// @ (0xF9F * 8 + 6)
#define                                 ADIP_bit            _BIT_ACCESS(IPR1,6)
// SSP1CON2<ADMSK1>
extern volatile __bit                   ADMSK1              __at(0x7E29);	// @ (0xFC5 * 8 + 1)
#define                                 ADMSK1_bit          _BIT_ACCESS(SSP1CON2,1)
// SSP1CON2<ADMSK11>
extern volatile __bit                   ADMSK11             __at(0x7E29);	// @ (0xFC5 * 8 + 1)
#define                                 ADMSK11_bit         _BIT_ACCESS(SSP1CON2,1)
// SSP1CON2<ADMSK2>
extern volatile __bit                   ADMSK2              __at(0x7E2A);	// @ (0xFC5 * 8 + 2)
#define                                 ADMSK2_bit          _BIT_ACCESS(SSP1CON2,2)
// SSP1CON2<ADMSK21>
extern volatile __bit                   ADMSK21             __at(0x7E2A);	// @ (0xFC5 * 8 + 2)
#define                                 ADMSK21_bit         _BIT_ACCESS(SSP1CON2,2)
// SSP1CON2<ADMSK3>
extern volatile __bit                   ADMSK3              __at(0x7E2B);	// @ (0xFC5 * 8 + 3)
#define                                 ADMSK3_bit          _BIT_ACCESS(SSP1CON2,3)
// SSP1CON2<ADMSK31>
extern volatile __bit                   ADMSK31             __at(0x7E2B);	// @ (0xFC5 * 8 + 3)
#define                                 ADMSK31_bit         _BIT_ACCESS(SSP1CON2,3)
// SSP1CON2<ADMSK4>
extern volatile __bit                   ADMSK4              __at(0x7E2C);	// @ (0xFC5 * 8 + 4)
#define                                 ADMSK4_bit          _BIT_ACCESS(SSP1CON2,4)
// SSP1CON2<ADMSK41>
extern volatile __bit                   ADMSK41             __at(0x7E2C);	// @ (0xFC5 * 8 + 4)
#define                                 ADMSK41_bit         _BIT_ACCESS(SSP1CON2,4)
// SSP1CON2<ADMSK5>
extern volatile __bit                   ADMSK5              __at(0x7E2D);	// @ (0xFC5 * 8 + 5)
#define                                 ADMSK5_bit          _BIT_ACCESS(SSP1CON2,5)
// SSP1CON2<ADMSK51>
extern volatile __bit                   ADMSK51             __at(0x7E2D);	// @ (0xFC5 * 8 + 5)
#define                                 ADMSK51_bit         _BIT_ACCESS(SSP1CON2,5)
// ADCON0<ADON>
extern volatile __bit                   ADON                __at(0x7E10);	// @ (0xFC2 * 8 + 0)
#define                                 ADON_bit            _BIT_ACCESS(ADCON0,0)
// SSP1CON3<AHEN>
extern volatile __bit                   AHEN                __at(0x7E59);	// @ (0xFCB * 8 + 1)
#define                                 AHEN_bit            _BIT_ACCESS(SSP1CON3,1)
// PORTA<AN0>
extern volatile __bit                   AN0                 __at(0x7C00);	// @ (0xF80 * 8 + 0)
#define                                 AN0_bit             _BIT_ACCESS(PORTA,0)
// PORTA<AN1>
extern volatile __bit                   AN1                 __at(0x7C01);	// @ (0xF80 * 8 + 1)
#define                                 AN1_bit             _BIT_ACCESS(PORTA,1)
// PORTA<AN2>
extern volatile __bit                   AN2                 __at(0x7C02);	// @ (0xF80 * 8 + 2)
#define                                 AN2_bit             _BIT_ACCESS(PORTA,2)
// PORTA<AN3>
extern volatile __bit                   AN3                 __at(0x7C03);	// @ (0xF80 * 8 + 3)
#define                                 AN3_bit             _BIT_ACCESS(PORTA,3)
// PORTA<AN4>
extern volatile __bit                   AN4                 __at(0x7C05);	// @ (0xF80 * 8 + 5)
#define                                 AN4_bit             _BIT_ACCESS(PORTA,5)
// ANSELA<ANSA0>
extern volatile __bit                   ANSA0               __at(0x7AD8);	// @ (0xF5B * 8 + 0)
#define                                 ANSA0_bit           _BIT_ACCESS(ANSELA,0)
// ANSELA<ANSA1>
extern volatile __bit                   ANSA1               __at(0x7AD9);	// @ (0xF5B * 8 + 1)
#define                                 ANSA1_bit           _BIT_ACCESS(ANSELA,1)
// ANSELA<ANSA2>
extern volatile __bit                   ANSA2               __at(0x7ADA);	// @ (0xF5B * 8 + 2)
#define                                 ANSA2_bit           _BIT_ACCESS(ANSELA,2)
// ANSELA<ANSA3>
extern volatile __bit                   ANSA3               __at(0x7ADB);	// @ (0xF5B * 8 + 3)
#define                                 ANSA3_bit           _BIT_ACCESS(ANSELA,3)
// ANSELA<ANSA5>
extern volatile __bit                   ANSA5               __at(0x7ADD);	// @ (0xF5B * 8 + 5)
#define                                 ANSA5_bit           _BIT_ACCESS(ANSELA,5)
// ANSELB<ANSB0>
extern volatile __bit                   ANSB0               __at(0x7AE0);	// @ (0xF5C * 8 + 0)
#define                                 ANSB0_bit           _BIT_ACCESS(ANSELB,0)
// ANSELB<ANSB1>
extern volatile __bit                   ANSB1               __at(0x7AE1);	// @ (0xF5C * 8 + 1)
#define                                 ANSB1_bit           _BIT_ACCESS(ANSELB,1)
// ANSELB<ANSB2>
extern volatile __bit                   ANSB2               __at(0x7AE2);	// @ (0xF5C * 8 + 2)
#define                                 ANSB2_bit           _BIT_ACCESS(ANSELB,2)
// ANSELB<ANSB3>
extern volatile __bit                   ANSB3               __at(0x7AE3);	// @ (0xF5C * 8 + 3)
#define                                 ANSB3_bit           _BIT_ACCESS(ANSELB,3)
// ANSELB<ANSB4>
extern volatile __bit                   ANSB4               __at(0x7AE4);	// @ (0xF5C * 8 + 4)
#define                                 ANSB4_bit           _BIT_ACCESS(ANSELB,4)
// ANSELB<ANSB5>
extern volatile __bit                   ANSB5               __at(0x7AE5);	// @ (0xF5C * 8 + 5)
#define                                 ANSB5_bit           _BIT_ACCESS(ANSELB,5)
// ANSELC<ANSC2>
extern volatile __bit                   ANSC2               __at(0x7AEA);	// @ (0xF5D * 8 + 2)
#define                                 ANSC2_bit           _BIT_ACCESS(ANSELC,2)
// ANSELC<ANSC6>
extern volatile __bit                   ANSC6               __at(0x7AEE);	// @ (0xF5D * 8 + 6)
#define                                 ANSC6_bit           _BIT_ACCESS(ANSELC,6)
// ANSELC<ANSC7>
extern volatile __bit                   ANSC7               __at(0x7AEF);	// @ (0xF5D * 8 + 7)
#define                                 ANSC7_bit           _BIT_ACCESS(ANSELC,7)
// PIE2<BCL1IE>
extern volatile __bit                   BCL1IE              __at(0x7D03);	// @ (0xFA0 * 8 + 3)
#define                                 BCL1IE_bit          _BIT_ACCESS(PIE2,3)
// PIR2<BCL1IF>
extern volatile __bit                   BCL1IF              __at(0x7D0B);	// @ (0xFA1 * 8 + 3)
#define                                 BCL1IF_bit          _BIT_ACCESS(PIR2,3)
// IPR2<BCL1IP>
extern volatile __bit                   BCL1IP              __at(0x7D13);	// @ (0xFA2 * 8 + 3)
#define                                 BCL1IP_bit          _BIT_ACCESS(IPR2,3)
// PIE2<BCLIE>
extern volatile __bit                   BCLIE               __at(0x7D03);	// @ (0xFA0 * 8 + 3)
#define                                 BCLIE_bit           _BIT_ACCESS(PIE2,3)
// PIR2<BCLIF>
extern volatile __bit                   BCLIF               __at(0x7D0B);	// @ (0xFA1 * 8 + 3)
#define                                 BCLIF_bit           _BIT_ACCESS(PIR2,3)
// IPR2<BCLIP>
extern volatile __bit                   BCLIP               __at(0x7D13);	// @ (0xFA2 * 8 + 3)
#define                                 BCLIP_bit           _BIT_ACCESS(IPR2,3)
// SSP1STAT<BF>
extern volatile __bit                   BF                  __at(0x7E38);	// @ (0xFC7 * 8 + 0)
#define                                 BF_bit              _BIT_ACCESS(SSP1STAT,0)
// SSP1STAT<BF1>
extern volatile __bit                   BF1                 __at(0x7E38);	// @ (0xFC7 * 8 + 0)
#define                                 BF1_bit             _BIT_ACCESS(SSP1STAT,0)
// HLVDCON<BGVST>
extern volatile __bit                   BGVST               __at(0x7CE6);	// @ (0xF9C * 8 + 6)
#define                                 BGVST_bit           _BIT_ACCESS(HLVDCON,6)
// SSP1CON3<BOEN>
extern volatile __bit                   BOEN                __at(0x7E5C);	// @ (0xFCB * 8 + 4)
#define                                 BOEN_bit            _BIT_ACCESS(SSP1CON3,4)
// RCON<BOR>
extern volatile __bit                   BOR                 __at(0x7E80);	// @ (0xFD0 * 8 + 0)
#define                                 BOR_bit             _BIT_ACCESS(RCON,0)
// SPBRG1<BRG0>
extern volatile __bit                   BRG0                __at(0x7D78);	// @ (0xFAF * 8 + 0)
#define                                 BRG0_bit            _BIT_ACCESS(SPBRG1,0)
// SPBRG1<BRG1>
extern volatile __bit                   BRG1                __at(0x7D79);	// @ (0xFAF * 8 + 1)
#define                                 BRG1_bit            _BIT_ACCESS(SPBRG1,1)
// SPBRGH1<BRG10>
extern volatile __bit                   BRG10               __at(0x7D82);	// @ (0xFB0 * 8 + 2)
#define                                 BRG10_bit           _BIT_ACCESS(SPBRGH1,2)
// SPBRGH1<BRG11>
extern volatile __bit                   BRG11               __at(0x7D83);	// @ (0xFB0 * 8 + 3)
#define                                 BRG11_bit           _BIT_ACCESS(SPBRGH1,3)
// SPBRGH1<BRG12>
extern volatile __bit                   BRG12               __at(0x7D84);	// @ (0xFB0 * 8 + 4)
#define                                 BRG12_bit           _BIT_ACCESS(SPBRGH1,4)
// SPBRGH1<BRG13>
extern volatile __bit                   BRG13               __at(0x7D85);	// @ (0xFB0 * 8 + 5)
#define                                 BRG13_bit           _BIT_ACCESS(SPBRGH1,5)
// SPBRGH1<BRG14>
extern volatile __bit                   BRG14               __at(0x7D86);	// @ (0xFB0 * 8 + 6)
#define                                 BRG14_bit           _BIT_ACCESS(SPBRGH1,6)
// SPBRGH1<BRG15>
extern volatile __bit                   BRG15               __at(0x7D87);	// @ (0xFB0 * 8 + 7)
#define                                 BRG15_bit           _BIT_ACCESS(SPBRGH1,7)
// BAUDCON1<BRG16>
extern volatile __bit                   BRG16               __at(0x7DC3);	// @ (0xFB8 * 8 + 3)
#define                                 BRG16_bit           _BIT_ACCESS(BAUDCON1,3)
// BAUDCON1<BRG161>
extern volatile __bit                   BRG161              __at(0x7DC3);	// @ (0xFB8 * 8 + 3)
#define                                 BRG161_bit          _BIT_ACCESS(BAUDCON1,3)
// SPBRG1<BRG2>
extern volatile __bit                   BRG2                __at(0x7D7A);	// @ (0xFAF * 8 + 2)
#define                                 BRG2_bit            _BIT_ACCESS(SPBRG1,2)
// SPBRG1<BRG3>
extern volatile __bit                   BRG3                __at(0x7D7B);	// @ (0xFAF * 8 + 3)
#define                                 BRG3_bit            _BIT_ACCESS(SPBRG1,3)
// SPBRG1<BRG4>
extern volatile __bit                   BRG4                __at(0x7D7C);	// @ (0xFAF * 8 + 4)
#define                                 BRG4_bit            _BIT_ACCESS(SPBRG1,4)
// SPBRG1<BRG5>
extern volatile __bit                   BRG5                __at(0x7D7D);	// @ (0xFAF * 8 + 5)
#define                                 BRG5_bit            _BIT_ACCESS(SPBRG1,5)
// SPBRG1<BRG6>
extern volatile __bit                   BRG6                __at(0x7D7E);	// @ (0xFAF * 8 + 6)
#define                                 BRG6_bit            _BIT_ACCESS(SPBRG1,6)
// SPBRG1<BRG7>
extern volatile __bit                   BRG7                __at(0x7D7F);	// @ (0xFAF * 8 + 7)
#define                                 BRG7_bit            _BIT_ACCESS(SPBRG1,7)
// SPBRGH1<BRG8>
extern volatile __bit                   BRG8                __at(0x7D80);	// @ (0xFB0 * 8 + 0)
#define                                 BRG8_bit            _BIT_ACCESS(SPBRGH1,0)
// SPBRGH1<BRG9>
extern volatile __bit                   BRG9                __at(0x7D81);	// @ (0xFB0 * 8 + 1)
#define                                 BRG9_bit            _BIT_ACCESS(SPBRGH1,1)
// TXSTA1<BRGH>
extern volatile __bit                   BRGH                __at(0x7D62);	// @ (0xFAC * 8 + 2)
#define                                 BRGH_bit            _BIT_ACCESS(TXSTA1,2)
// TXSTA1<BRGH1>
extern volatile __bit                   BRGH1               __at(0x7D62);	// @ (0xFAC * 8 + 2)
#define                                 BRGH1_bit           _BIT_ACCESS(TXSTA1,2)
// UEIE<BTOEE>
extern volatile __bit                   BTOEE               __at(0x7B34);	// @ (0xF66 * 8 + 4)
#define                                 BTOEE_bit           _BIT_ACCESS(UEIE,4)
// UEIR<BTOEF>
extern volatile __bit                   BTOEF               __at(0x7B3C);	// @ (0xF67 * 8 + 4)
#define                                 BTOEF_bit           _BIT_ACCESS(UEIR,4)
// UEIE<BTSEE>
extern volatile __bit                   BTSEE               __at(0x7B37);	// @ (0xF66 * 8 + 7)
#define                                 BTSEE_bit           _BIT_ACCESS(UEIE,7)
// UEIR<BTSEF>
extern volatile __bit                   BTSEF               __at(0x7B3F);	// @ (0xF67 * 8 + 7)
#define                                 BTSEF_bit           _BIT_ACCESS(UEIR,7)
// CM1CON0<C1CH0>
extern volatile __bit                   C1CH0               __at(0x7CC0);	// @ (0xF98 * 8 + 0)
#define                                 C1CH0_bit           _BIT_ACCESS(CM1CON0,0)
// CM1CON0<C1CH1>
extern volatile __bit                   C1CH1               __at(0x7CC1);	// @ (0xF98 * 8 + 1)
#define                                 C1CH1_bit           _BIT_ACCESS(CM1CON0,1)
// CM2CON1<C1HYS>
extern volatile __bit                   C1HYS               __at(0x7CD3);	// @ (0xF9A * 8 + 3)
#define                                 C1HYS_bit           _BIT_ACCESS(CM2CON1,3)
// PIE2<C1IE>
